"use strict";
// Задача 1.
// Напишите цикл, который выводит числа от 1 до 20, но пропускает те числа, которые делятся на 4 без остатка.
for (let i = 1; i <= 20; i++) {
  if (i % 4 !== 0) {
    console.log(i);
  }
}

// Задача 2.
// С помощью цикла for вычислите факториал числа (произведение всех чисел от 1 до заданного числа). Используйте prompt для получение начального значения.
const number = +prompt(
  "Введите натуральное число (от 0 и до бесконечности)",
  0,
);
let factorial = 1;

for (let i = 2; i <= number; i++) {
  factorial *= i;
}
console.log(factorial);
// Это делается проще через while всё же

// *Задача 3.
// Выведите в консоль шахматную доску размером 8x8, где символы чередуются (например, # и пробел). Начинайте с # в первой ячейке первой строки.
const sizeBoard = 8;
let board = "";

for (let i = 0; i < sizeBoard; i++) {
  for (let j = 0; j < sizeBoard; j++) {
    board += (i + j) % 2 === 0 ? "Ч" : "Б";
    board += j === sizeBoard - 1 ? "\n" : " ";
  }
}
console.log(board);
